[
  {
    "id": "blog13",
    "image": "images (5).jpeg",
    "category": "Campus Stories",
    "date": "2025-09-13",
    "author": "Aisha Bello",
    "title": "My Most Embarrassing Day on Campus (and What I Learned)",
    "excerpt": "<div class=\"flowbite-card\"><div class=\"p-6\"><h2 class=\"text-2xl font-bold mb-4 pb-2\">My Most Embarrassing Day on Campus (and What I Learned)</h2><p>Every student has that one day they wish they could erase from their campus memory. For me, it was the day I became “that girl” in my department, the story people whispered about and laughed over for weeks. Looking back now, it’s hilarious, but that day? Omo, I wanted the ground to open and swallow me.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">The Build-Up: Morning Wahala</h3><p>It all started on a Wednesday morning. I had an 8am lecture with Dr. Okoye—the one lecturer you never want to annoy. I woke up late because I’d been up revising for a test, and my alarms decided to betray me. The hostel was already buzzing, queues everywhere. I rushed to the bathroom, did a quick “wash and go,” threw on my best white shirt and black skirt, and dashed out with my bag, notes, and a bottle of water.</p><p>Outside, I realized I had just enough time to get to class. I started power-walking, mentally rehearsing my answers for the test. Halfway to the faculty, I tripped on a loose tile and nearly fell, but I caught myself. A group of guys laughed, but I just smiled and kept moving—no time for embarrassment.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">The Real Disaster</h3><p>I got to class just as Dr. Okoye was entering. I squeezed into the front row, trying to catch my breath. Suddenly, I felt a weird chill on my back. I reached behind and realized, to my horror, that my skirt had ripped wide open from the waistband down! I must have torn it when I stumbled earlier. My bag had hidden the tear until I sat down.</p><p>At that moment, I froze. My mind raced: “Should I run out? Should I stay glued to my seat?” My classmates were already settling in, and nobody seemed to notice yet. But I couldn’t move without exposing myself even more. And then, just as I was planning my escape, Dr. Okoye called me out: “Aisha, please come and solve this question on the board.”</p><p>My heart stopped. I tried to signal my friend, but she was busy copying notes. I stood up slowly, clutching my bag behind me, and shuffled to the front. As I started writing, I heard giggles from the back. I realized the tear was now obvious. My face burned. I fumbled through the question, barely making sense, and rushed back to my seat, bag still glued to my back.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">The Aftermath</h3><p>After the lecture, my friend finally noticed my distress. “Aisha, what happened?” she whispered. I explained, and she burst out laughing, then quickly tied her scarf around my waist. We laughed together, and I made a mad dash back to the hostel, avoiding eye contact with everyone. On the way, a girl from another department smiled at me and said, “Don’t worry, it happens to the best of us.” That made me feel a bit better.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">How the Story Spread</h3><p>By the next day, the gist had spread. People were making jokes about “the girl with the designer skirt,” and even my course mates teased me (in a friendly way, thank God). At first, I was mortified. But after a while, I realized everyone had their own embarrassing stories, and mine wasn’t even the worst.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">What I Learned</h3><ul class=\"list-disc ml-6\"><li><strong>Always check your outfit before leaving hostel:</strong> One minute of checking could save you a week of embarrassment!</li><li><strong>Carry a scarf or sweater:</strong> It’s a lifesaver—trust me!</li><li><strong>Don’t take yourself too seriously:</strong> Campus life is full of surprises. If you can laugh at yourself, nothing can really shake you.</li><li><strong>Friends make everything better:</strong> A good friend will help you tie a scarf and laugh with you, not at you.</li><li><strong>Everyone has their “oops” moments:</strong> The sooner you own it, the sooner people move on.</li></ul><p class=\"mt-6\">Now, whenever someone brings up that story, I just laugh and add extra spice to the gist. After all, what’s campus life without a little drama? My most embarrassing day became one of my favorite memories—because it taught me confidence, resilience, and how to laugh, even when things don’t go as planned.</p></div></div>",
    "reads": 0,
    "university": "OAU"
  },
  {
    "id": "blog21",
    "image": "images (7).jpeg",
    "category": "Academic",
    "date": "2025-09-13",
    "author": "Aisha Bello",
    "title": "Surviving Group Projects: My Lessons from the Trenches",
    "excerpt": "<div class=\"flowbite-card\"><div class=\"p-6\"><h2 class=\"text-2xl font-bold mb-4 pb-2\">Surviving Group Projects: My Lessons from the Trenches</h2><p>If you’ve ever heard someone say “group project” in a Nigerian university, you already know the wahala that’s about to start. To be honest, before my first big group assignment at OAU, I thought it would just be a simple matter of meeting up, sharing topics, and submitting on time. Omo, I was wrong! Group projects are a whole different ball game, and I learned so much the hard way.</p><p>It all started in 300 level, second semester. Our lecturer, Mr. Adeyemi, announced in class, “You’ll be working in groups of five for your final assessment. The topic and group list will be posted before the end of the week.” The whole class groaned. I looked around and saw some people already forming alliances, whispering to their favorite course mates. Me, I just prayed to land in a group with at least one serious person.</p><p>When the list finally dropped, my heart skipped a beat. My group had:</p><ul class=\"list-disc ml-6\"><li><strong>Blessing</strong> – The quiet, bookish girl who always sits in front.</li><li><strong>Emeka</strong> – The ‘big boy’ who’s always talking about his side hustle and never seems to attend lectures.</li><li><strong>Hauwa</strong> – Very friendly, but always “busy” with one thing or the other.</li><li><strong>Ghost</strong> (real name Ibrahim) – I only ever saw his name on the register, never in class.</li><li>And of course, <strong>me</strong>.</li></ul><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">First Contact: WhatsApp Drama</h3><p>I created a WhatsApp group, dropped a cheerful “Hi everyone, let’s introduce ourselves and set up our first meeting!” For two days, only Blessing replied. Emeka finally responded with, “Sup? I dey hustle, just tag me when ready.” Hauwa sent a voice note about being busy with her CDS (NYSC stuff, even though she wasn’t a corps member!). Ghost? Blue ticks, no reply.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">Trying to Meet Up</h3><p>We fixed a meeting at the library for Saturday morning. I got there early, Blessing joined with her notebook, and we waited. Emeka texted, “Stuck in traffic, make una start.” Hauwa sent, “Sorry, my auntie just came from Kano, can we move to 3pm?” Ghost didn’t say a word. By noon, only Blessing and I were there. We started going through the project brief, brainstorming ideas and dividing the sections.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">Dividing the Work (Or Trying To!)</h3><p>We agreed to assign everyone a part, hoping they’d do their share. Here’s how it went:</p><ul class=\"list-disc ml-6\"><li>Blessing: Introduction and Literature Review (she volunteered, thank God!)</li><li>Me: Data Analysis and Conclusion (I just took the hardest part, so I’d have control)</li><li>Emeka: Survey Design (since he claimed to know “people”)</li><li>Hauwa: Methodology</li><li>Ghost: Abstract (how hard can it be, abi?)</li></ul><p>We set a deadline: “Let’s submit our drafts by next Friday.” Everyone said “no wahala!” I even dropped reminders on the group chat every two days.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">The Real Wahala Begins</h3><p>Friday came. Blessing sent her draft—clean, well-referenced, and even with extra notes for us. Hauwa sent three paragraphs with typos and a message: “Sorry, my cousin’s wedding held me up. I’ll finish tomorrow.” Emeka dropped his part at 1am Saturday, full of slang and copied directly from a blog. Ghost? Silence.</p><p>By Sunday, the deadline was close. I called Emeka—he didn’t pick. I texted Hauwa, she replied, “Sorry dear, I’ll send it soon.” Blessing and I began piecing together the work, editing and chasing references. We realized Emeka’s “survey” was just a list of random questions, and Hauwa’s section had nothing about our actual topic. I ended up rewriting half of both their sections.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">Ghost’s Big Reveal</h3><p>On Sunday night, Ghost finally replied: “Sorry, I’ve been busy. Here’s my abstract.” He sent three lines that didn’t even relate to our project! I nearly burst out laughing. At this point, I just wrote the abstract myself.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">All-Nighter and Submission</h3><p>The night before submission, Blessing and I were up till 2am, editing, formatting, and referencing. My laptop battery almost died (thank God for hostel generator). I was eating Indomie with one hand and typing with the other. We finally finished, saved on three flash drives, and submitted by 8am.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">The Presentation Day</h3><p>Here’s where it gets funny. On presentation day, suddenly everyone was present—well dressed, holding copies of “our” project. Emeka was the first to volunteer for presenting, speaking with confidence like he wrote everything. Hauwa added points, and even Ghost showed up, standing at the back, nodding like he contributed! I just stood there, half amused, half exhausted.</p><p>After the presentation, our lecturer praised the work but asked some deep questions. Blessing and I answered most of them, while Emeka and Hauwa just smiled. Ghost kept quiet. When we got the result, we scored a strong B+. Emeka dropped in the group chat, “Nice one, guys!” I just shook my head.</p><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">Lessons I Learned (The Hard Way!)</h3><ul class=\"list-disc ml-6\"><li><strong>Start early and take initiative:</strong> Don’t wait for everyone to get serious. If you want a good grade, start the ball rolling yourself.</li><li><strong>Be clear and firm:</strong> Assign tasks, set deadlines, and send reminders. Don’t be shy to follow up.</li><li><strong>Expect some people to slack off:</strong> There’s always a “Ghost” in every group. Don’t let it surprise you.</li><li><strong>Work with who shows up:</strong> Sometimes, only one or two people will do most of the work. Team up with the serious ones and move on.</li><li><strong>Document everything:</strong> Keep copies of all chats, drafts, and emails. In case there’s trouble later, you have proof.</li><li><strong>Don’t over-stress:</strong> Group projects can be frustrating, but don’t let them steal your peace. Laugh about it, do your best, and keep it moving.</li><li><strong>Share credit, but know your worth:</strong> Let everyone present, but don’t forget who actually did the work. At the end of the day, your effort counts.</li></ul><h3 class=\"text-lg font-semibold mt-6 mb-2 pb-1\">Final Thoughts</h3><p>Group projects in Nigerian universities are a real test of patience, leadership, and sometimes, your sense of humor. They teach you how to work with different personalities—some serious, some unserious, some who just want to collect marks. Now, whenever I get assigned to a new group, I don’t panic anymore. I just remember my “trench” days and say, “No wahala, we go survive.”</p><p>If you’re facing your own group project wahala, just know you’re not alone. Gather your energy, find the serious ones, and remember: even if you end up doing most of the work, you’re building skills—and stories—you’ll never forget!</p></div></div>",
    "reads": 0,
    "university": "OAU"
  },
  {
    "id": "blog2",
    "image": "images (7).jpeg",
    "category": "Campus Life",
    "date": "2025-09-13",
    "author": "Aisha Bello",
    "title": "How I Managed My First Hostel Room (and My Crazy Roommates)",
    "excerpt": "<div class=\"flowbite-card\"><div class=\"p-6\"><h2 class=\"text-2xl font-bold mb-4\">How I Managed My First Hostel Room (and My Crazy Roommates)</h2><p>Before I gained admission, I used to daydream about university hostel life. I pictured myself in a neat little room, maybe a small plant by the window, and late-night gists with friends over noodles. But let me just say—reality humbled me! Nothing prepares you for hostel wahala in a Nigerian university, especially when you have to share a room with complete strangers.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Arrival Day: Welcome to the Jungle</h3><p>I still remember the day I moved into Awo Hall at OAU. My mum helped me carry my Ghana-must-go bag, stepping carefully to avoid the puddles on the hostel walkway. Everywhere was buzzing—students dragging boxes, parents shouting instructions, and porters yelling, “Next!” My heart was pounding. “Aisha, you go survive this one?”</p><p>When I entered my assigned room, I met three faces staring at me like I was a new character in a TV show. There was Ada, already arranging her clothes with military precision; Sade, on her bed, blasting music and eating gala; and Zainab, quietly reading a novel in the corner. I greeted, “Good afternoon!” and they replied with varying levels of enthusiasm.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Space Wahala</h3><p>First problem: space. Our room was small, with four bunks squeezed together, and everyone came with luggage as if we were relocating for five years. Ada had two huge boxes and a suitcase. Sade, I don’t even know how she fit all her shoes and bags. Zainab was the minimalist, just one bag and a stack of books. I squeezed my things into a corner and prayed nobody would “mistakenly” borrow my provisions.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Roommate Drama Begins</h3><p>The first week was all about setting ground rules. Ada wanted the room swept every morning before 7am. Sade didn’t care—she’d play music at any hour, and sometimes her friends would come in, laughing loudly late at night. Zainab was always reading and didn’t like noise, but she never complained. Me? I just tried to blend in and avoid wahala.</p><p>One night, Sade’s friends came over and started dancing shaku shaku, shaking the bunks so much I thought the whole room would collapse. Ada shouted, “Please, some of us have 8am lectures!” Sade just increased the volume. The next morning, Ada swept angrily and warned, “Anybody that cannot keep to rules should look for another room!” Tension dey.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Hostel Survival Hacks</h3><ul class=\"list-disc ml-6\"><li><strong>Padlock everything:</strong> If you leave your Milo or chin chin out, just say goodbye. Provisions move mysteriously in hostels!</li><li><strong>Mark your bucket:</strong> If you don’t write your name on your bucket, it will grow legs and disappear to another block.</li><li><strong>Always have extension box:</strong> Four people, one socket—na fight be that. My extension box became my most prized possession.</li><li><strong>Earplugs are life-savers:</strong> With Sade’s music and Ada’s early morning alarms, I had to invest in good earplugs if I wanted any sleep.</li><li><strong>Respect people’s space:</strong> I learned to ask before borrowing anything, and to always return it—even if it’s just a spoon.</li></ul><h3 class=\"text-lg font-semibold mt-6 mb-2\">Bonding Moments</h3><p>It wasn’t all stress, sha. There were nights we’d gist till 2am, sharing stories about secondary school crushes, village Christmas, and hostel crushes (that one na secret!). Sometimes, we’d cook noodles together and laugh about our lecturers’ funny accents. Zainab eventually dropped her shyness and joined our talks, surprising us with her wicked sense of humor.</p><p>During exam week, the room transformed. Ada became the “mummy,” making sure everyone ate and slept. Sade would boil water for us to bathe early, and Zainab would quiz us with past questions. We formed a small family, looking out for each other—even when we fought over who left the bathroom wet.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Unforgettable Hostel Memories</h3><p>My first harmattan in the hostel, we all huddled together for warmth and shared shawls. The day NEPA took light for two days straight, we turned it into a campfire night, telling ghost stories by torchlight and laughing until we cried. When Ada’s birthday came, we threw her a surprise party with biscuits, sweets, and a homemade card.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Life Lessons I Learned</h3><ul class=\"list-disc ml-6\"><li><strong>Patience and tolerance:</strong> Living with different people isn’t easy, but you learn to understand and accept their quirks.</li><li><strong>Communication is key:</strong> Don’t bottle up issues. Talk it out, even if it means a small argument now and then.</li><li><strong>Share and care:</strong> Sometimes, giving a little—like sharing your last sachet of milk—builds strong friendships.</li><li><strong>Laugh at the madness:</strong> Hostel life is chaotic, but it’s also what makes university memorable.</li></ul><p class=\"mt-6\">Now, when I look back, I realize those hostel days were some of the best times of my life. The noise, the fights, the laughter, even the missing buckets—all part of the journey. If you’re about to stay in a hostel for the first time, my advice is simple: go with an open mind, prepare for small wahala, and enjoy every moment. You’ll come out with stories you’ll tell for years—just like me.</p></div></div>",
    "reads": 0,
    "university": "OAU"
  },
  {
    "id": "blog1",
    "image": "images (4).jpeg",
    "category": "Entrepreneurship",
    "date": "2025-09-13",
    "author": "Aisha Bello",
    "title": "Balancing Academics and Side Hustles: My Secret Formula",
    "excerpt": "<div class=\"flowbite-card\"><div class=\"p-6\"><h2 class=\"text-2xl font-bold mb-4\">Balancing Academics and Side Hustles: My Secret Formula</h2><p>If you’ve ever tried to juggle classes and a side hustle in a Nigerian university, you’ll know it’s not beans at all! When I first got into OAU, I thought all I had to do was face my books, attend lectures, and maybe join one or two clubs. But after just one semester, I realized: pocket money finishes fast, and “broke” is not a good look. That’s how my journey into the world of side hustles began.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">The Wake-Up Call</h3><p>It was my first semester, and I had just finished buying textbooks, handouts, and—of course—gala and La Casera for lunch. I checked my account balance and almost fainted. I called my mum, and she said, “Aisha, you have to learn how to manage what you have. University is not for spending anyhow.” That was the day I decided, “No more waiting for monthly allowance. I must find a way to make my own money.”</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">My First Hustle: Thrift Queen</h3><p>My first side hustle was selling thrift clothes. I had a knack for spotting nice “okrika” at the market, so I started buying cute tops and jeans, washing and ironing them, and advertising on my WhatsApp status. My first customer was my roommate, then her friends, then people from my department. Before I knew it, I was making small, steady profit. Whenever someone complimented my outfit, I’d just smile and say, “I fit run am for you!”</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">The Balancing Act</h3><p>But balancing school and hustle wasn’t easy. There were days when I’d have 8am lectures, a test in the afternoon, and still need to deliver clothes in the evening. My bag was always heavy—books, calculator, and a nylon of tops for delivery. I had to learn the art of time management, fast! I bought a small planner and started writing down everything: lectures, assignment deadlines, market runs, and customer meet-ups.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Learning the Hard Way</h3><p>Of course, there were days I nearly crashed. One time, I stayed up late tagging clothes for an Instagram sale, only to oversleep and miss a quiz. Another time, I forgot to submit an assignment because I was busy answering customers’ DMs. After that, I made a rule: academics first, hustle second. I started blocking out “study hours” for myself, no matter how tempting the sales were.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Discovering Multiple Streams</h3><p>As time went on, I tried other hustles too. I baked small chops for birthdays, did freelance writing for blogs, and even became a campus brand ambassador for a phone company (free T-shirts and small stipends, but it added up!). Each hustle came with its own wahala—late payments, difficult customers, and sometimes, pure exhaustion. But each one also taught me a new skill.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">Support System</h3><p>I can’t lie, my friends were my biggest support. Sometimes they’d help me deliver orders or remind me about schoolwork. We created a “hustle group chat” where we shared tips, helped each other with assignments, and even pooled money for bulk purchases. There’s something about hustling together that makes the stress feel lighter.</p><h3 class=\"text-lg font-semibold mt-6 mb-2\">What Helped Me Succeed</h3><ul class=\"list-disc ml-6\"><li><strong>Time management:</strong> I learned to use alarms, planners, and reminders. If you don’t plan, you’ll end up overwhelmed.</li><li><strong>Prioritizing:</strong> I never let my hustle get in the way of important tests or deadlines. If it meant telling a customer to wait, so be it.</li><li><strong>Asking for help:</strong> I wasn’t afraid to ask friends for support, whether it was covering a class or helping with deliveries.</li><li><strong>Rest and self-care:</strong> I learned the hard way that burning out helps no one. I scheduled time to relax and recharge, even if it was just with a movie or music.</li><li><strong>Learning to say “no”:</strong> Sometimes, I had to turn down a gig or customer if it clashed with my studies. It was hard, but necessary.</li></ul><h3 class=\"text-lg font-semibold mt-6 mb-2\">The Payoff</h3><p>Balancing school and hustle wasn’t just about the money (though, let’s be honest, buying my own data and snacks felt great!). It gave me confidence, taught me discipline, and helped me discover talents I never knew I had. Now, when people ask how I manage, I just smile and say, “It’s all about planning, passion, and knowing when to rest.”</p><p class=\"mt-6\">So if you’re thinking of starting a side hustle while in school, go for it—but don’t let your grades suffer. Hustle smart, not just hard. And remember, your dreams are valid—one small gig at a time!</p></div></div>",
    "reads": 0,
    "university": "OAU"
  },
  {
    "id": "blog10",
    "image": "https://images.unsplash.com/photo-1551836022-4c4c79ecde16?auto=format&fit=crop&w=600&q=80",
    "category": "Evaluation",
    "date": "2025-09-01",
    "author": "Admin",
    "title": "Top Classroom Resources for Teachers",
    "excerpt": "Discover the ultimate list of classroom tools and resources to help teachers inspire students and boost performance.",
    "reads": 212,
    "university": "UNILAG"
  },
  {
    "id": "blog12",
    "image": "https://images.unsplash.com/photo-1517841905240-472988babdf9?auto=format&fit=crop&w=600&q=80",
    "category": "MATH",
    "date": "2025-08-28",
    "author": "Admin",
    "title": "Promoting Health and Wellbeing in Schools",
    "excerpt": "Health is wealth! Explore practical ways schools can encourage healthy habits in students and staff.",
    "reads": 178,
    "university": "UI"
  },
  {
    "id": "blog3",
    "image": "https://images.unsplash.com/photo-1521737852567-6949f3f9f2b5?auto=format&fit=crop&w=600&q=80",
    "category": "Involvement",
    "date": "2025-08-21",
    "author": "Admin",
    "title": "Involving Students in School Activities",
    "excerpt": "Student participation matters! See how extracurricular activities shape character and build community.",
    "reads": 120,
    "university": "UNN"
  },
  {
    "id": "blog4",
    "image": "images (7).jpeg",
    "category": "Leadership",
    "date": "2025-07-30",
    "author": "Chinedu Okeke",
    "title": "How Group Study Saved My Semester",
    "excerpt": "Studying alone was my thing—until I nearly failed. Here’s why joining a campus study group turned things around for me.",
    "reads": 342,
    "university": "UNILAG"
  },
  {
    "id": "blog5",
    "image": "images (24).jpeg",
    "category": "Communication",
    "date": "2025-07-23",
    "author": "Aisha Bello",
    "title": "My First Online Mock Exam: What I Got Wrong",
    "excerpt": "No more crowded halls or invigilator stares. My first digital test was a rollercoaster—here’s what I wish I knew before clicking ‘Start’.",
    "reads": 289,
    "university": "OAU"
  },
  {
    "id": "blog6",
    "image": "examguide_bg1.webp?auto=format&fit=crop&w=600&q=80",
    "category": "Tech",
    "date": "2025-07-15",
    "author": "Samuel Ero",
    "title": "Debugging: The Real MVP of Coding",
    "excerpt": "For every “Hello World” that runs, there’s a bug that tries to spoil the party. Here’s how CODECX made me see errors as friends, not foes.",
    "reads": 221,
    "university": "UNIBEN"
  },
  {
    "id": "blog7",
    "image": "csc2.webp",
    "category": "Marketplace",
    "date": "2025-07-10",
    "author": "Hauwa Sani",
    "title": "How I Sold My Old Textbooks & Got Lunch Money",
    "excerpt": "From “Who wants?” in group chats to actual sales on ExamGuard, here’s how our marketplace helped me declutter and survive week 7 hunger.",
    "reads": 198,
    "university": "UI"
  },
  {
    "id": "blog8",
    "image": "csc1.webp",
    "category": "Reading",
    "date": "2025-07-05",
    "author": "Chika Nwosu",
    "title": "Reading and Earning? Here’s How I Did It",
    "excerpt": "Earning money just for reading articles? Sounds like a dream, but ExamGuard made it a reality for me (and my airtime balance).",
    "reads": 166,
    "university": "UNN"
  },
  {
    "id": "blog9",
    "image": "images (24).jpeg",
    "category": "Academic",
    "date": "2025-07-02",
    "author": "Tunde Faleye",
    "title": "Why I Stopped Fearing Past Questions",
    "excerpt": "I used to avoid past questions, but here’s why they became my secret weapon for acing exams—no more “surprise topics”!",
    "reads": 147,
    "university": "LASU"
  }
]
